app/services/matcher_service.rb

INSERT INTO "swipes" ("liker_id", "target_id", "action", "created_at", "updated_at") VALUES (2, 6, 0, '2026-08-11 02:33:35.077529', '2026-08-11 02:33:35.077529') RETURNING "id"
SELECT "swipes".* FROM "swipes" WHERE "swipes"."liker_id" = 2 AND "swipes"."target_id" = 6 LIMIT 1
SELECT 1 AS one FROM "swipes" WHERE "swipes"."liker_id" = 6 AND "swipes"."target_id" = 2 AND "swipes"."action" = 0 LIMIT 1
---
  def self.like(liker, target)
    Swipe.find_or_create_by!(liker: liker, target: target) { |s| s.action = :like }
    return false if liker == target
    return false unless Swipe.exists?(liker: target, target: liker, action: :like)

INSERT INTO "matches" ("user_a_id", "user_b_id", "status", "last_message_at", "created_at", "updated_at") VALUES (2, 3, 0, NULL, '2026-08-11 02:33:35.886421', '2026-08-11 02:33:35.886421') RETURNING "id"
---
  def self.create_match(user_a, user_b)
    a, b = [ user_a, user_b ].sort_by(&:id)
    Match.active.find_or_create_by!(user_a_id: a.id, user_b_id: b.id)