app/services/recommendation_service.rb

SELECT "blocks"."blocker_id" FROM "blocks" WHERE "blocks"."blocked_id" = 2
---
    def blocked_by_ids
      Block.where(blocked_id: @user.id).pluck(:blocker_id)