app/controllers/admin/dashboard_controller.rb

    def index
      @stats = {
        users: User.count,
        verified_users: User.verified.count,
        pending_identity: IdentityVerification.pending.count,
        pending_education: EducationVerification.pending.count,
        pending_photos: Photo.pending.count,
        matches: Match.count
---
SELECT COUNT(*) FROM "matches"
SELECT COUNT(*) FROM "users"