app/controllers/admin/education_verifications_controller.rb

SELECT "education_verifications".* FROM "education_verifications" ORDER BY "education_verifications"."created_at" DESC LIMIT 100
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
---
    def index
      @verifications = EducationVerification.order(created_at: :desc)
      @verifications = @verifications.where(status: params[:status]) if params[:status].present?
      @verifications = @verifications.includes(:user).limit(100)