app/controllers/admin/identity_verifications_controller.rb

    def index
      @verifications = IdentityVerification.order(created_at: :desc)
      @verifications = @verifications.where(status: params[:status]) if params[:status].present?
      @verifications = @verifications.includes(:user).limit(100)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)