app/controllers/admin/identity_verifications_controller.rb

    def index
      @verifications = IdentityVerification.order(created_at: :desc)
      @verifications = @verifications.where(status: params[:status]) if params[:status].present?
      @verifications = @verifications.includes(:user).limit(100)
---
SELECT "identity_verifications".* FROM "identity_verifications" ORDER BY "identity_verifications"."created_at" DESC LIMIT $1  [["LIMIT", 100]]

    def approve
      @verification = IdentityVerification.find(params[:id])
      @verification.update!(status: :verified, verified_at: Time.current, reviewer: admin_user, reviewed_at: Time.current, rejection_reason: nil)
---
SELECT "identity_verifications".* FROM "identity_verifications" WHERE "identity_verifications"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "identity_verifications" SET "reviewed_at" = $1, "reviewed_by" = $2, "updated_at" = $3, "verified_at" = $4 WHERE "identity_verifications"."id" = $5  [["reviewed_at", "2026-08-11 03:11:59.197075"], ["reviewed_by", 135138680], ["updated_at", "2026-08-11 03:11:59.199205"], ["verified_at", "2026-08-11 03:11:59.193936"], ["id", 14]]
UPDATE "users" SET "updated_at" = $1, "verification_level" = $2, "verified_at" = $3 WHERE "users"."id" = $4  [["updated_at", "2026-08-11 03:11:59.211466"], ["verification_level", 1], ["verified_at", "2026-08-11 03:11:59.210597"], ["id", 980190962]]