app/controllers/admin/photos_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "photos" SET "reviewed_at" = $1, "reviewed_by" = $2, "status" = $3, "updated_at" = $4 WHERE "photos"."id" = $5  [["reviewed_at", "2026-08-11 03:11:21.934965"], ["reviewed_by", 135138680], ["status", 1], ["updated_at", "2026-08-11 03:11:21.940814"], ["id", 25]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
SELECT 1 AS one FROM "photos" WHERE "photos"."user_id" = $1 AND "photos"."status" = $2 AND "photos"."primary" = $3 LIMIT $4  [["user_id", 980190962], ["status", 1], ["primary", true], ["LIMIT", 1]]
---
    def approve
      @photo = Photo.find(params[:id])
      @photo.update!(status: :approved, reviewer: admin_user, reviewed_at: Time.current, rejection_reason: nil)
      # 若用户还没有头像，将首张通过的照片设为主图
      unless @photo.user.photos.approved.primary.exists?