app/controllers/admin/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY "photos"."created_at" DESC LIMIT 100
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)
---
    def index
      @photos = Photo.order(created_at: :desc)
      @photos = @photos.where(status: params[:status]) if params[:status].present?
      @photos = @photos.includes(:user).limit(100)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 8 LIMIT 1
UPDATE "photos" SET "status" = 1, "reviewed_by" = 1, "reviewed_at" = '2026-08-11 03:10:37.441422', "updated_at" = '2026-08-11 03:10:37.454418' WHERE "photos"."id" = 8
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT 1 AS one FROM "photos" WHERE "photos"."user_id" = 2 AND "photos"."status" = 1 AND "photos"."primary" = TRUE LIMIT 1
---
    def approve
      @photo = Photo.find(params[:id])
      @photo.update!(status: :approved, reviewer: admin_user, reviewed_at: Time.current, rejection_reason: nil)
      # 若用户还没有头像，将首张通过的照片设为主图
      unless @photo.user.photos.approved.primary.exists?