app/controllers/admin/users_controller.rb

    def suspend
      @user = User.find(params[:id])
      @user.update!(status: :suspended)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "status" = 2, "updated_at" = '2026-08-11 03:10:50.198102' WHERE "users"."id" = 2

    def unsuspend
      @user = User.find(params[:id])
      @user.update!(status: :active)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "users" SET "status" = 1, "updated_at" = '2026-08-11 03:10:50.406219' WHERE "users"."id" = 2