app/controllers/admin/users_controller.rb

    def index
      @users = User.order(created_at: :desc)
      @users = @users.where(verification_level: params[:verification_level]) if params[:verification_level].present?
      @users = @users.limit(100)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC LIMIT $1  [["LIMIT", 100]]

    def suspend
      @user = User.find(params[:id])
      @user.update!(status: :suspended)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", 2], ["updated_at", "2026-08-11 03:11:22.552381"], ["id", 980190962]]

    def unsuspend
      @user = User.find(params[:id])
      @user.update!(status: :active)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", 1], ["updated_at", "2026-08-11 03:11:22.565251"], ["id", 980190962]]