app/services/verification/education_verification_service.rb

INSERT INTO "education_verifications" ("user_id", "verify_code", "report_no", "school", "degree", "education_level", "provider", "status", "rejection_reason", "response", "reviewed_by", "reviewed_at", "verified_at", "created_at", "updated_at") VALUES (1, '100000000001', 'ABCDEF1234567890', '北京大学', '本科', 3, 'mock', 1, NULL, '{"school":"北京大学","degree":"本科","education_level":3}', NULL, NULL, '2026-08-11 02:15:57.910328', '2026-08-11 02:15:57.910766', '2026-08-11 02:15:57.910766') RETURNING "id"
UPDATE "users" SET "verification_level" = 2, "verified_at" = '2026-08-11 02:15:57.923682', "updated_at" = '2026-08-11 02:15:57.924359' WHERE "users"."id" = 1
---
    def verify(verify_code:, report_no:)
      record = EducationVerification.new(
        user: @user, verify_code: verify_code.to_s.strip,
        report_no: report_no.to_s.strip, provider: @provider_name
      )

      return record unless record.valid?

      result = provider.verify(verify_code: record.verify_code, report_no: record.report_no)

      if result.success
        record.status = :verified
        record.verified_at = Time.current
        record.rejection_reason = nil
        record.response = result.data
        record.school = result.data[:school]
        record.degree = result.data[:degree]
        record.education_level = result.data[:education_level]
        record.save!

        # V2 = 身份证 + 学信网；若身份证未通过则保持当前等级（学历徽章单独展示）
        @user.update!(verification_level: :fully_verified, verified_at: Time.current) if @user.identity_verifications.verified.exists?