app/services/verification/id_card_verification_service.rb

INSERT INTO "identity_verifications" ("user_id", "full_name", "id_number", "provider", "status", "rejection_reason", "response", "reviewed_by", "reviewed_at", "verified_at", "created_at", "updated_at") VALUES (1, '张三', '{"p":"eCaBL3NQ9JbZWF00Ve2uNakc","h":{"iv":"5xZM1wMBQWwmmF/1","at":"xg5amqRGJfRGTcr4IYb1qw=="}}', 'mock', 1, NULL, '{"masked_id_number":"1101**********002X"}', NULL, NULL, '2026-08-11 02:15:57.745787', '2026-08-11 02:15:57.746498', '2026-08-11 02:15:57.746498') RETURNING "id"
UPDATE "users" SET "verification_level" = 1, "verified_at" = '2026-08-11 02:15:57.863732', "updated_at" = '2026-08-11 02:15:57.870189' WHERE "users"."id" = 1
INSERT INTO "identity_verifications" ("user_id", "full_name", "id_number", "provider", "status", "rejection_reason", "response", "reviewed_by", "reviewed_at", "verified_at", "created_at", "updated_at") VALUES (1, '李四', '{"p":"+qCb1vVjf+FRELdKQmXbKvWy","h":{"iv":"6laT+oLtaICrNVBd","at":"Z4bBNK95KRYcDTlk6IXczw=="}}', 'mock', 2, '姓名与证件号不匹配（Mock 拒绝）', NULL, NULL, NULL, NULL, '2026-08-11 02:15:57.935043', '2026-08-11 02:15:57.935043') RETURNING "id"
---
    def verify(full_name:, id_number:, photo: nil)
      record = IdentityVerification.new(
        user: @user, full_name: full_name.to_s.strip,
        id_number: id_number.to_s.strip, provider: @provider_name
      )
      record.id_card_photo.attach(photo) if photo

      return record unless record.valid?

      result = provider.verify(full_name: record.full_name, id_number: record.id_number)

      if result.success
        record.status = :verified
        record.verified_at = Time.current
        record.rejection_reason = nil
        record.response = result.data
        record.save!

        # V1 = 身份证；若学信网也已通过则升级为 V2
        new_level = @user.education_verifications.verified.exists? ? :fully_verified : :id_verified
        @user.update!(verification_level: new_level, verified_at: Time.current)
      else
        record.status = :rejected
        record.rejection_reason = result.message
        record.response = result.data
        record.save!