app/controllers/matches_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."match_id" = $1 ORDER BY "messages"."created_at" ASC  [["match_id", 3]]
UPDATE "match_memberships" SET "last_read_at" = $1, "updated_at" = $2 WHERE "match_memberships"."id" = $3  [["last_read_at", "2026-08-11 03:04:28.250234"], ["updated_at", "2026-08-11 03:04:28.254297"], ["id", 6]]
---
  def show
    @match = current_user.matches.active.find(params[:id])
    @messages = @match.messages.order(:created_at).includes(:sender)
    # 打开聊天室即标记已读
    @match.membership_for(current_user)&.update!(last_read_at: Time.current)