app/controllers/messages_controller.rb

  def create
    @message = @match.messages.build(message_params.merge(sender: current_user))

    if @message.save
---
INSERT INTO "messages" ("body", "created_at", "match_id", "sender_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "你好"], ["created_at", "2026-08-11 03:04:27.628625"], ["match_id", 1], ["sender_id", 980190962], ["updated_at", "2026-08-11 03:04:27.628625"]]