app/controllers/messages_controller.rb

  def create
    @message = @match.messages.build(message_params.merge(sender: current_user))

    if @message.save
---
INSERT INTO "messages" ("match_id", "sender_id", "body", "created_at", "updated_at") VALUES (1, 2, 'Hi Zhang Wei!', '2026-08-11 03:03:16.289693', '2026-08-11 03:03:16.289693') RETURNING "id"