app/controllers/photos_controller.rb

  def create
    photo = current_user.photos.build(photo_params)
    if photo.save
---
INSERT INTO "photos" ("user_id", "position", "status", "primary", "rejection_reason", "reviewed_by", "reviewed_at", "created_at", "updated_at") VALUES (2, 0, 0, FALSE, NULL, NULL, NULL, '2026-08-11 02:24:16.249949', '2026-08-11 02:24:16.249949') RETURNING "id"

  def set_primary
    photo = current_user.photos.approved.find(params[:id])
    photo.update!(primary: true)
---
UPDATE "photos" SET "updated_at" = '2026-08-11 02:24:16.275473' WHERE "photos"."id" = 1