app/controllers/profiles_controller.rb

  def cache_version_key
    return nil if action_name == "edit"

    [
      "profile", current_user.id,
      current_user.updated_at.to_i,
      current_user.identity_verifications.maximum(:updated_at).to_i,
      current_user.education_verifications.maximum(:updated_at).to_i,
      current_user.photos.maximum(:updated_at).to_i
    ].join(":")
---
UPDATE "users" SET "nickname" = 'Zoe', "gender" = 2, "birthdate" = '1998-05-20', "city" = 'Beijing', "height_cm" = 165, "education_level" = 3, "job" = 'Designer', "bio" = 'Hello', "pref_gender" = 1, "pref_age_min" = 25, "pref_age_max" = 35, "updated_at" = '2026-08-11 02:24:23.263708' WHERE "users"."id" = 2

  def update
    if current_user.update(profile_params)
---
UPDATE "users" SET "nickname" = 'Zoe', "gender" = 2, "birthdate" = '1998-05-20', "city" = 'Beijing', "height_cm" = 165, "education_level" = 3, "job" = 'Designer', "bio" = 'Hello', "pref_gender" = 1, "pref_age_min" = 25, "pref_age_max" = 35, "updated_at" = '2026-08-11 02:24:23.263708' WHERE "users"."id" = 2