app/controllers/sessions_controller.rb

INSERT INTO "users" ("avatar_photo_id", "bio", "birthdate", "city", "created_at", "education_level", "gender", "height_cm", "job", "last_active_at", "nickname", "password_digest", "phone", "pref_age_max", "pref_age_min", "pref_distance_km", "pref_gender", "pref_show_distance", "status", "updated_at", "verification_level", "verified_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22) RETURNING "id"
---
  def create
    @phone = params[:phone].to_s.strip
    sms_code = SmsCode.unconsumed.where(phone: @phone, purpose: :login)
                      .order(expires_at: :desc).first

    if sms_code&.valid_code?(params[:code].to_s.strip)
      sms_code.consume!
      user = User.find_or_create_by!(phone: @phone) { |u| u.nickname = "轻友#{@phone.last(4)}" }