app/controllers/sessions_controller.rb

SELECT "sms_codes".* FROM "sms_codes" WHERE "sms_codes"."consumed_at" IS NULL AND "sms_codes"."phone" = '13800009999' AND "sms_codes"."purpose" = 0 ORDER BY "sms_codes"."expires_at" DESC LIMIT 1
INSERT INTO "users" ("phone", "password_digest", "nickname", "gender", "birthdate", "city", "height_cm", "education_level", "job", "bio", "avatar_photo_id", "verification_level", "verified_at", "pref_gender", "pref_age_min", "pref_age_max", "pref_distance_km", "pref_show_distance", "status", "last_active_at", "created_at", "updated_at") VALUES ('13800009999', NULL, '轻友9999', 0, NULL, NULL, NULL, 0, NULL, NULL, NULL, 0, NULL, 2, 18, 45, 50, TRUE, 1, NULL, '2026-08-11 02:11:13.053550', '2026-08-11 02:11:13.053550') RETURNING "id"
---
  def create
    @phone = params[:phone].to_s.strip
    sms_code = SmsCode.unconsumed.where(phone: @phone, purpose: :login)
                      .order(expires_at: :desc).first

    if sms_code&.valid_code?(params[:code].to_s.strip)
      sms_code.consume!
      user = User.find_or_create_by!(phone: @phone) { |u| u.nickname = "轻友#{@phone.last(4)}" }