app/controllers/swipes_controller.rb

  def create
    target = User.find(params[:target_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 6 LIMIT 1