app/controllers/swipes_controller.rb

  def create
    target = User.find(params[:target_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 298486374], ["LIMIT", 1]]