app/controllers/verifications_controller.rb

SELECT "identity_verifications".* FROM "identity_verifications" WHERE "identity_verifications"."user_id" = 1 ORDER BY "identity_verifications"."created_at" DESC LIMIT 1
SELECT "education_verifications".* FROM "education_verifications" WHERE "education_verifications"."user_id" = 1 ORDER BY "education_verifications"."created_at" DESC LIMIT 1
---
  def show
    @identity = current_user.identity_verifications.order(created_at: :desc).first
    @education = current_user.education_verifications.order(created_at: :desc).first