app/models/message.rb

UPDATE "matches" SET "updated_at" = '2026-08-11 03:03:16.304438', "last_message_at" = '2026-08-11 03:03:16.304438' WHERE "matches"."id" = 1
---
    def broadcast_and_touch
      match.touch(:last_message_at)