app/models/photo.rb

UPDATE "photos" SET "primary" = FALSE WHERE "photos"."user_id" = 1 AND "photos"."primary" = TRUE AND "photos"."id" != 2
---
    def ensure_single_primary
      return unless primary?
      user.photos.where(primary: true).where.not(id: id).update_all(primary: false)

UPDATE "photos" SET "primary" = TRUE, "updated_at" = '2026-08-11 02:27:02.231073' WHERE "photos"."id" = 3
---
    def reassign_primary
      return unless primary?
      user.photos.approved.order(:position, :id).first&.update!(primary: true)